"A new version of %@ is available." = "גרסה חדשה של %@ זמינה.";

"%@ %@ is now available - you have %@. Would you like to download it now?" = "@% @% זמין כעת (יש לך @%). ברצונך להוריד כעת?";

"Download" = "הורד";

"Skip This Version" = "דלג על גרסה זו";

"Remind Me Later" = "הזכר לי מאוחר יותר";
